Tekla Open API Reference for Tekla Structures 2025
IEvents.Register Method
 Registers the instance to listen to the specified events. More event delegates should not be added without calling UnRegister first.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
void Register()
Sub Register
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace